app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.create(class_params)
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2018-11-06 18:23:33.880995"], ["updated_at", "2018-11-06 18:23:33.880995"]]

  def update
    @school_class.update(params.require(:school_class))
---
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2018-11-06 18:32:13.399530"], ["id", 1]]