app/controllers/students_controller.rb

  def create
    @student = Student.create(students_params)
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["created_at", "2018-11-06 18:24:09.419949"], ["updated_at", "2018-11-06 18:24:09.419949"]]

  def update
	  @student.update(params.require(:student))
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-11-06 18:32:13.616382"], ["id", 1]]